## 1. Write a program to make a name and age from the user and print a greeting message.

In [1]:
user_name = input("Your Name:")
user_age = input("Your Age")

print(f"Hello!, {user_name} Welcome to our course .Pls confirm your age {user_age}")

Your Name: Rangesh
Your Age 19

Hello!, Rangesh Welcome to our course .Pls confirm your age 19

## 2. Create a list of numbers and print only even number using a for loop.

In [4]:
numbers = range(1,20)
even_no = []

for i in numbers:
    if i%2 == 0:
        even_no.append(i)
print(even_no)

[2, 4, 6, 8, 10, 12, 14, 16, 18]

## 3. Write a program that handles division by zero using try-except.

In [15]:
get_num = int(input("Enter a number (Numerator):"))
get_den = int(input("Enter a number (Denominator):"))

try:
    result = (get_num/get_den)
    print(result)
except ZeroDivisionError:
    print("Invalid Entry !")

except ValueError:
    print("Invalid Entry !")
    
finally:
    print("Code successfully ended")

Enter a number (Numerator): 5
Enter a number (Denominator): 0

Invalid Entry !
Code successfully ended

### 4. Given a string , count how many vowels it has

In [18]:
user_input = input("Enter any word or sentence")
count = 0

for i in user_input.lower():
    if i in "aeiou":
        print(i)
        count += 1

print("Total no of Vowels are:",count)

Enter any word or sentence RAngeshPandian

a
e
a
i
a
Total no of Vowels are: 5

### 5. Reverse a list without using built-in-function

In [24]:
original_list = [1,2,3,4,5,6,7]
updated_list = []
i = len(original_list) - 1
while i>=0:
    updated_list.append(original_list[i])
    i -=1
    
updated_list

[7, 6, 5, 4, 3, 2, 1]

### 6. Create a dictionary with at least 5 key-value pairs and print them.

In [26]:
import pandas as pd

In [53]:
std_db = { "First Name":["Rangesh", "Aakash" , "Aanish"],
         "Last Name":["Pandian","NaN","Nithin"],
           "Age" :[19,20,19],
           "CGPA" :[9.40 , 9.0 , 9.5],
           "Location":["Theni","Kovilpatti","Hosur"]
}
std_db

{'First Name': ['Rangesh', 'Aakash', 'Aanish'],
 'Last Name': ['Pandian', 'NaN', 'Nithin'],
 'Age': [19, 20, 19],
 'CGPA': [9.4, 9.0, 9.5],
 'Location': ['Theni', 'Kovilpatti', 'Hosur']}

In [48]:
import pandas as pd
df = pd.DataFrame(std_db)
df.to_csv("std_db.csv", index=False) #From here importing the csv file out

### 7. Write a Pandas code to read a CSV and print the top 5 rows.

In [50]:
pd.read_csv("employee_data.csv").head()

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024

### 8. Create a DataFrame from a python dictionary.

In [51]:
std_db = { "First Name":["Rangesh", "Aakash" , "Aanish"],
         "Last Name":["Pandian","NaN","Nithin"],
           "Age" :[19,20,19],
           "CGPA" :[9.40 , 9.0 , 9.5],
           "Location":["Theni","Kovilpatti","Hosur"]
}
pd.DataFrame(std_db)

  First Name Last Name  Age  CGPA    Location
0    Rangesh   Pandian   19   9.4       Theni
1     Aakash       NaN   20   9.0  Kovilpatti
2     Aanish    Nithin   19   9.5       Hosur

### 9. Replace all missing values in a DataFrame with the column's mean.

In [55]:
employee_data = pd.read_csv("employee_data.csv")
employee_data

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech      NaN  12-11-2020

In [58]:
mean_value = employee_data["Salary"].mean()
mean_value

np.float64(62500.0)

In [75]:
employee_data["Salary"] = employee_data["Salary"].fillna(employee_data["Salary"].mean())
employee_data

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech  62500.0  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech  62500.0  12-11-2020

### 10. Filter rows in a DataFrame where the "Age" column is greater than 30.

employee_data

In [77]:
employee_data[employee_data["Age"]>30]

    Name   Age Department   Salary   Join_Date
1  Nasir  31.0    IT Tech  62500.0  12-11-2020
5  Navin  35.0    Support  72000.0  19-08-2023
6    NaN  40.0         IT  64000.0  10-09-2022
7  Nasir  31.0    IT Tech  62500.0  12-11-2020

# The End !!